### Truncate data

In [1]:
import pandas as pd

In [2]:
sr = pd.Series([19.5, 16.8, 22.78, 20.124, 18.1002])
sr

0    19.5000
1    16.8000
2    22.7800
3    20.1240
4    18.1002
dtype: float64

In [12]:
truncData = sr.truncate(before=1, after=3)
truncData

1    16.800
2    22.780
3    20.124
dtype: float64

### Iterating

In [13]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
  
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [22]:
# Iterating row using iterrows()
for i, j in df.iterrows():
    print(i)
    print(j)
    print()

0
name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1
name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2
name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3
name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

In [24]:
# Iteration over rows using iteritems()
for key, value in df.items():
    print(key)
    print(value)
    print()

name
0    aparna
1    pankaj
2    sudhir
3     Geeku
Name: name, dtype: object

degree
0       MBA
1       BCA
2    M.Tech
3       MBA
Name: degree, dtype: object

score
0    90
1    40
2    80
3    98
Name: score, dtype: int64

### Sort

In [28]:
df = pd.read_csv('./DataSets/FB-no-date.csv', sep=';')
df.head()

        Open       High        Low      Close  Adj Close    Volume
0  162600006  163130005  161690002  162279999  162279999  11097800
1  163899994  167500000  163830002  167369995  167369995  18894700
2  167369995  171880005  166550003  171259995  171259995  28187900
3  172899994  173570007  171270004  172509995  172509995  21531700
4  171500000  171740005  167610001  169130005  169130005  18306500

In [33]:
sorted_df = df.sort_values('Open', axis=0, ascending=True, inplace=False, na_position='last')
sorted_df.head()

         Open       High        Low      Close  Adj Close    Volume
12  161479996  163820007  160820007  161570007  161570007  25611500
13  161500000  166119995  161240005  165440002  165440002  20211500
0   162600006  163130005  161690002  162279999  162279999  11097800
16  163000000  166539993  162000000  166289993  166289993  12631200
11  163570007  163899994  159279999  160470001  160470001  37524200